app/views/articles/show.html.erb


<h3><%= pluralize(@article.comments.count, 'Comment') %></h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 10]]