app/controllers/articles_controller.rb

	def show
	#	render json: params
		@article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]

	def create
		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "this is the fourth article"], ["created_at", Tue, 15 Apr 2014 16:25:56 UTC +00:00], ["title", "fourth article"], ["updated_at", Tue, 15 Apr 2014 16:25:56 UTC +00:00]]

	def destroy
		@article = Article.find(params[:id])
		@article.delete
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "articles" WHERE "articles"."id" = 1

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = 8  [["title", "tenth articlee"], ["body", "thsi is the tenth article"], ["updated_at", Tue, 15 Apr 2014 19:32:41 UTC +00:00]]