app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		# render json: params
		@comment = Comment.new(comment_params)
		@comment.article_id = params[:article_id]
		@comment.save